app/controllers/companies_controller.rb

  def index
     @type = params[:type]
  	 @q = Company.ransack(params[:q])
  	 @companies = @q.result.page(params[:page]).per(400)
---
SELECT COUNT(*) FROM "companies"

 def update
    @company = Company.find(params[:id])
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]